Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДолговыеОбязательства/Ext/ObjectModule.bsl
Перем ТекстИзменений;	
	
Процедура ПередЗаписью(Отказ)
	////Если Не Ссылка.Пустая() Тогда
	////	Запрос = Новый Запрос("ВЫБРАТЬ
	////						  |	ДолговыеОбязательства.Организация
	////						  |ИЗ
	////						  |	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	////						  |ГДЕ
	////						  |	ДолговыеОбязательства.Ссылка = &Ссылка");
	////	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	////	Если Организация <> Запрос.Выполнить().Выгрузить()[0].Организация Тогда
	////		Сообщить("Нельзя изменять организацию!");
	////		Отказ = Истина;
	////	КонецЕсли;
	////КонецЕсли;
	
	Если ВалютаДоговора.Пустая() Тогда
		ВалютаДоговора = Константы.ВалютаРегламентированногоУчета.Получить();
		УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю("ДО: " + Ссылка + 
				": т.к. валюта долгового обязательства не была заполнена, то проставлена валюта регламентированного учета", 
				Ссылка,,,);
		//Сообщить(, СтатусСообщения.Внимание); 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) Тогда
		ЭтотОбъект.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	//Если Не РежимОбновления Тогда
	   //Отказ = Не КонтрольВозможностиИзмененияВалютыДО(Истина); 001	
	//КонецЕсли;
	
	//
	ЭтотОбъект.ВладелецДолжник = "";
	ЭтотОбъект.ВладелецКонтрагент = "";
	ЭтотОбъект.ВладелецКредитор = "";
	
	ЭтотОбъект.Должник = Неопределено;
	ЭтотОбъект.Контрагент = Неопределено;
	ЭтотОбъект.Кредитор = Неопределено;
	
	Для Каждого Элемент Из ЭтотОбъект.Контрагенты Цикл
		Если Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Должник Тогда
			ЭтотОбъект.ВладелецДолжник = ЭтотОбъект.ВладелецДолжник + "; " + Элемент.Значение.Наименование;
			Если ЭтотОбъект.Должник.Пустая() Тогда
				ЭтотОбъект.Должник = Элемент.Значение;
			КонецЕсли;
		ИначеЕсли Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Контрагент Тогда
			ЭтотОбъект.ВладелецКонтрагент = ЭтотОбъект.ВладелецКонтрагент + "; " + Элемент.Значение.Наименование;
			Если ЭтотОбъект.Контрагент.Пустая() Тогда
				ЭтотОбъект.Контрагент = Элемент.Значение;
			КонецЕсли;
		ИначеЕсли Элемент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Кредитор Тогда
			ЭтотОбъект.ВладелецКредитор = ЭтотОбъект.ВладелецКредитор + "; " + Элемент.Значение.Наименование;
			Если ЭтотОбъект.Кредитор.Пустая() Тогда
				ЭтотОбъект.Кредитор = Элемент.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	ЭтотОбъект.ВладелецДолжник = Сред(ЭтотОбъект.ВладелецДолжник, 3);
	ЭтотОбъект.ВладелецКонтрагент = Сред(ЭтотОбъект.ВладелецКонтрагент, 3);
	ЭтотОбъект.ВладелецКредитор = Сред(ЭтотОбъект.ВладелецКредитор, 3);
	
	//
	Если ЭтотОбъект.Должник.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Должник должен быть заполнен!");
		Возврат;
	КонецЕсли;
	
	
	//
	ЭтотОбъект.ВладелецУслуга = "";
	Для Каждого Элемент Из ЭтотОбъект.Услуги Цикл
		ЭтотОбъект.ВладелецУслуга = ЭтотОбъект.ВладелецУслуга + "; " + Элемент.Значение.Наименование; 		
	КонецЦикла;	
	ЭтотОбъект.ВладелецУслуга = Сред(ЭтотОбъект.ВладелецУслуга, 3);	
	
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.Значение КАК Услуга
	                      |ПОМЕСТИТЬ Таблица
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Таблица.Услуга.Владелец.Наименование КАК Наименование
	                      |ИЗ
	                      |	Таблица КАК Таблица
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Запрос.УстановитьПараметр("Таблица", Услуги.Выгрузить());
	Результат = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.ВладелецДоговор = "";
	Пока Результат.Следующий() Цикл
		ЭтотОбъект.ВладелецДоговор = ЭтотОбъект.ВладелецДоговор + "; " + Результат.Наименование; 
	КонецЦикла;
	ЭтотОбъект.ВладелецДоговор = Сред(ЭтотОбъект.ВладелецДоговор, 3);
	
	//
	ТекстИзменений = ОбъектыСервер.ПроверитьИзмененияВОбъекте(ЭтотОбъект);
КонецПроцедуры

Функция КонтрольВозможностиИзмененияВалютыДО(Сообщать) Экспорт
	УспешностьПроверки = Истина;	

	Если ЭтоНовый() Тогда
		Возврат УспешностьПроверки;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктуальнаяЗадолженностьОстатки.СуммаРеглОстаток
	               |ИЗ
	               //|	РегистрНакопления.АктуальнаяЗадолженность.Остатки КАК АктуальнаяЗадолженностьОстатки
				   |	РегистрНакопления.ЗадолженностьПоДолговомуОбязательству.Остатки КАК АктуальнаяЗадолженностьОстатки
				   |ГДЕ
	               |	АктуальнаяЗадолженностьОстатки.ДолговоеОбязательство = &ДолговоеОбязательство";
	
	Запрос.УстановитьПараметр("ДолговоеОбязательство", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Если Сообщать Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Сообщить(""+Ссылка+": невозможно изменение валюты ДО, т.к. по данному обязательству присутствует остаток (в валюте РУ): "+Выборка.СуммаРеглОстаток, СтатусСообщения.Внимание); 	
			УспешностьПроверки=Ложь;		
		КонецЕсли;      	 	
	КонецЕсли;
	
	Возврат УспешностьПроверки;
КонецФункции

// Процедура - обработчик события "ОбработкаЗаполнения".
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//ОсновнойМенеджер = ПараметрыСеанса.ТекущийПользователь;
	//ДатаРегистрации = ТекущаяДата();
	
	//Если ДанныеЗаполнения = Неопределено Тогда
		Если ВалютаДоговора.Пустая() Тогда
			ВалютаДоговора = Константы.ВалютаРегламентированногоУчета.Получить();
			//Сообщить("ДО: "+Ссылка+": т.к. валюта долгового обязательства не была заполнена,
			//	то проставлена валюта регламентированного учета", СтатусСообщения.Внимание); 	
		КонецЕсли;      	
	//КонецЕсли;

	// Выполним заполнение контактной информации
	//УправлениеКонтактнойИнформацией.ОбработкаЗаполненияКИ(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Наименование") Тогда
		//создание из взаимодействия по описанию участника
		Наименование = ДанныеЗаполнения.Наименование;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Справочники.Пользователи.ОтслеживаниеИзменений(Отказ, Ссылка, ТекстИзменений);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.КодДО = "";
КонецПроцедуры
